{
  "backend/main.mo": "Main Motoko actor defining stable state and CRUD operations for user profiles, districts, and villages, with role-based access control (admin/user) and mixins for authorization and blob storage.",
  "backend/migration.mo": "Simple migration module that passes actor state through unchanged, preserving nextDistrictId and nextVillageId across canister upgrades.",
  "feature_evidence.json": "Feature evidence report documenting an investigation into the VillagesSection not rendering in production due to empty stable state or data sync issues between draft and production canisters.",
  "frontend-file-summaries.txt": "Auto-generated summaries of all frontend source files, describing each component's purpose, styling palette, and key functionality.",
  "frontend/index.css": "Global Tailwind CSS base with OKLCH color token variables for light and dark modes, defining the design system's color, border, and chart tokens.",
  "frontend/index.html": "HTML entry point for the Hindi-language foundation site, loading Noto Serif/Sans Devanagari and Cinzel fonts from Google Fonts and mounting the React app.",
  "frontend/src/App.tsx": "Root React component implementing hash-based routing that renders AdminPanel at `#/admin` and the full homepage section stack (Hero through Footer) for all other routes.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying mission, vision, foundation history, and an 11-card core values grid with lucide-react icons using the maroon/gold palette.",
  "frontend/src/components/ActivitiesSection.tsx": "Displays a section of activity cards fetched from the backend (with loading skeletons) and seeds activities on mount. Also shows static impact statistics in a dark-themed grid.",
  "frontend/src/components/AdminPanel.tsx": "A passcode-protected admin panel for managing districts, villages, donations, memberships, assistance requests, and contact inquiries, including a bulk import modal for district/village data.",
  "frontend/src/components/AssistanceSection.tsx": "Renders a validated assistance request form that collects name, mobile number, city, and assistance type, then submits the data via a mutation hook with toast feedback.",
  "frontend/src/components/ContactSection.tsx": "Displays foundation contact info (address, phone, email, social links) fetched dynamically and provides a validated contact inquiry form with submission handling.",
  "frontend/src/components/DonationSection.tsx": "Renders a donation section with UPI QR code, copyable bank details, preset amount buttons, and a validated donor form that submits donation records via a mutation hook.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with the foundation branding, quick navigation links, a Quranic quote, and a copyright bar with a heart icon.",
  "frontend/src/components/GallerySection.tsx": "Displays a responsive photo gallery grid of six foundation events with hover overlays and captions, with fallback handling for missing images.",
  "frontend/src/components/GovernmentSchemesSection.tsx": "Shows a grid of six Indian government welfare schemes (housing, health, scholarships, etc.) with icons, descriptions, and eligibility details.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with the foundation logo, desktop nav links, a mobile hamburger menu, a search icon, and smooth-scroll/hash routing logic including an admin link.",
  "frontend/src/components/HeroSection.tsx": "Full-width hero banner with a background image, dark overlay, foundation name in Hindi/English, a tagline badge, and CTA buttons for donation and about sections.",
  "frontend/src/components/MembershipSection.tsx": "Membership registration form with text fields (name, mobile, email, city, Aadhaar) and file upload fields for address and identity proof, submitting via a React Query mutation hook.",
  "frontend/src/components/SearchBar.tsx": "A modal search bar component that filters predefined Hindi/English site sections by keyword and scrolls to the matching section anchor on selection.",
  "frontend/src/components/VillagesSection.tsx": "Displays an accordion list of districts fetched from the backend, each expandable to show its associated villages as chips loaded via a separate query.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (anonymous or authenticated) using TanStack Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing AuthClient creation, login/logout flow, and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend data operations (activities, donations, memberships, assistance requests, contact inquiries, foundation info, districts, villages), currently stubbed to return empty data after a backend migration.",
  "frontend/src/index.css": "Global stylesheet that imports Devanagari/Cinzel fonts, defines an oklch-based maroon/gold CSS variable theme, and declares reusable Tailwind component classes for the site's Islamic-inspired design.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, using sessionStorage for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color palettes (maroon, tan, gold, cream), brand-specific font families, border radii, and semantic color tokens for the app's UI.",
  "project_state.json": "Project state tracker (version 45) documenting the Hindi-language charitable society app's architecture, color palette, existing features, and known bugs including admin panel issues and missing production sections."
}