{
  "backend/main.mo": "Main Motoko actor for the backend canister that manages user profiles, districts, and villages with role-based access control (admin/user permissions) and includes blob storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report linking the Admin Panel Villages tab end-to-end verification feature (manual add, bulk CSV/Excel import, text-paste import) to the AdminPanel.tsx file and test REQ-58.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, describing each component's purpose, styling palette, and key functionality for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark mode color tokens (background, foreground, primary, destructive, chart colors, sidebar) used throughout the UI.",
  "frontend/index.html": "HTML entry point with Hindi lang attribute, Google Fonts preconnect for Noto Serif/Sans Devanagari and Cinzel, and SEO meta description for the Gausiya Ashrafia Foundation site.",
  "frontend/src/App.tsx": "Root React app component implementing hash-based routing that renders AdminPanel at `#/admin` and the full homepage section stack (Hero, About, Donation, etc.) for all other routes.",
  "frontend/src/components/AboutSection.tsx": "About Us section displaying mission/vision cards, foundation history, and an 11-item core values grid with lucide-react icons using the maroon/gold OKLCH color palette.",
  "frontend/src/components/ActivitiesSection.tsx": "Activities section that fetches and displays activity cards with images and dates via React Query, seeds initial activities on mount, and shows impact statistics with all numeric values set to zero.",
  "frontend/src/components/AdminPanel.tsx": "A protected admin dashboard with passcode and Internet Identity authentication, providing tabbed views for donations, memberships, assistance requests, contacts, and district/village management with bulk CSV import support.",
  "frontend/src/components/AssistanceSection.tsx": "A form section allowing users to submit assistance requests (name, mobile, city, assistance type) with validation, submitted via the useAddAssistanceRequest mutation hook.",
  "frontend/src/components/ContactSection.tsx": "A contact section displaying foundation info (address, phone, email, social links) fetched from the backend, alongside a contact inquiry form with validation that submits via useAddContactInquiry.",
  "frontend/src/components/DonationSection.tsx": "A donation section showing UPI QR code and bank details with copy-to-clipboard functionality, plus a form to record donor name, amount, and message via the useAddDonation mutation.",
  "frontend/src/components/Footer.tsx": "A site footer displaying the foundation branding, quick navigation links, a Quranic quote, and a copyright bar with a bottom border gradient.",
  "frontend/src/components/GallerySection.tsx": "A static gallery section rendering a 3-column grid of event images with captions, hover overlay effects, and fallback handling for missing images.",
  "frontend/src/components/GovernmentSchemesSection.tsx": "Renders a grid of cards showcasing six Indian government welfare schemes (e.g., PM Awas Yojana, Ayushman Bharat) with Hindi descriptions, eligibility info, and color-coded icons.",
  "frontend/src/components/Header.tsx": "Sticky navigation header for the foundation site with a logo, Hindi nav links, smooth-scroll handling, mobile hamburger menu, search icon toggle, and an admin route link.",
  "frontend/src/components/HeroSection.tsx": "Full-width hero banner with a background image, dark overlay, foundation name in Hindi/English, a tagline badge, and two CTA buttons linking to the donate and about sections.",
  "frontend/src/components/MembershipSection.tsx": "Membership registration form with text fields (name, mobile, email, city, Aadhaar) and file upload fields for address and identity proof, submitting via the useAddMembership hook with validation and toast feedback.",
  "frontend/src/components/SearchBar.tsx": "Modal search overlay that filters a static list of site sections by label or keywords and scrolls to the selected section on selection.",
  "frontend/src/components/VillagesSection.tsx": "Accordion-style section that lists districts fetched from the backend; expanding a district card lazily loads and displays its associated village chips.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating app data (activities, donations, memberships, assistance requests, contact inquiries, foundation info) with all backend calls currently stubbed to return empty data.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, configures Tailwind base/components/utilities, and defines a maroon/red Islamic-themed design system with CSS custom properties and reusable component classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/utils/clipboard.ts": "Utility function that copies text to the clipboard using the modern Clipboard API with a fallback to the legacy execCommand approach for mobile browser compatibility.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with a maroon/red Islamic color palette (maroon, tan, gold, cream), Devanagari font families, custom border radii, and CSS variable-based semantic color tokens.",
  "project_state.json": "Tracks the project state (version 55) for the गौसिया अशरफिया फाउंडेशन charitable society app, including architectural notes, known issues (admin panel bugs, village tab errors), and a list of existing features."
}