{
  "backend/main.mo": "Main Motoko actor for the Gausiya Asharafia Foundation backend, defining stable state, data types, and CRUD methods for districts, villages, user profiles, membership applications, donations, contact inquiries, and assistance requests, with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report confirming that the 'Admin Panel' button/link was added to the main navigation header (Header.tsx) with high confidence, mapping to test REQ-1.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, describing their purpose, styling, and key functionality for build planning reference.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes including background, foreground, card, primary, border, and chart color tokens.",
  "frontend/index.html": "HTML entry point for the React app with Hindi language attribute, Google Fonts preconnect for Noto Serif Devanagari, Noto Sans Devanagari, and Cinzel, and an SEO meta description in Hindi.",
  "frontend/src/App.tsx": "Root React component implementing hash-based client-side routing for home, districts, villages-manage, and admin routes, rendering the appropriate page layout and conditionally showing the SearchBar overlay.",
  "frontend/src/components/AboutSection.tsx": "About section component with Intersection Observer scroll animations, displaying mission/vision cards, foundation history, and an 11-item core values grid styled in the maroon/gold theme.",
  "frontend/src/components/ActivitiesSection.tsx": "Displays a section of the foundation's activities (education, food, health, etc.) as animated cards with icons and Hindi text, plus a stats bar showing impact numbers.",
  "frontend/src/components/AdminGuard.tsx": "Wraps admin content with session-based authentication, showing a loading spinner while checking sessionStorage and redirecting to AdminLogin if unauthenticated.",
  "frontend/src/components/AdminLogin.tsx": "Renders a password login form for the admin panel, using a mutation hook to verify credentials and storing the session in sessionStorage on success.",
  "frontend/src/components/AdminPanel.tsx": "Main admin dashboard wrapped in AdminGuard, providing tabbed navigation between membership requests, donations, contact requests, and members list with a logout button.",
  "frontend/src/components/AssistanceSection.tsx": "Renders a Hindi-language assistance request form with validation, submitting data via a mutation hook and showing toast notifications on success or failure.",
  "frontend/src/components/ContactRequestsTab.tsx": "Admin tab component that displays contact inquiries and assistance requests in sub-tabs, fetching data via query hooks and rendering loading skeletons or error states.",
  "frontend/src/components/ContactSection.tsx": "A contact section component with a scroll-triggered animation, displaying organization contact info (address, phone, email) and a validated inquiry form that submits via a React Query mutation.",
  "frontend/src/components/DistrictsPage.tsx": "An admin page for managing districts with CRUD operations (add, edit, delete) using React Query hooks, featuring inline editing forms and a card-based list with navigation support.",
  "frontend/src/components/DonationSection.tsx": "A donation section supporting UPI payments via preset amounts, deep links for multiple UPI apps (GPay, PhonePe, Paytm, BHIM), a QR code modal, and bank transfer details with copy-to-clipboard functionality.",
  "frontend/src/components/DonationsTab.tsx": "An admin tab that fetches and displays donation intent records with summary cards for total donors and total amount, including loading skeletons and error/empty states.",
  "frontend/src/components/Footer.tsx": "A site footer with the foundation branding, quick navigation links, a discreet admin link, and a Quranic quote section, styled with a dark maroon/gold theme.",
  "frontend/src/components/GalleryImageWithFallback.tsx": "An image component that shows a loading pulse placeholder while an image loads and renders a fallback icon with Hindi error text if the image fails to load.",
  "frontend/src/components/GallerySection.tsx": "Renders a photo gallery section with a responsive grid of static event/meeting images, scroll-triggered animation, and hover captions in Hindi using Devanagari fonts.",
  "frontend/src/components/GovernmentSchemesSection.tsx": "Displays a grid of six Indian government welfare schemes (e.g., PM Awas, Ayushman Bharat) with icons, descriptions, and eligibility info, with scroll-triggered animation.",
  "frontend/src/components/Header.tsx": "Fixed navigation header with a logo, Hindi nav links that smooth-scroll to page sections or route via hash, a search button, and an admin panel link, with scroll-based styling changes and a mobile hamburger menu.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a background image, maroon overlay, shimmer effect, and staggered fade-in animations displaying the foundation name in Hindi/Urdu along with call-to-action buttons.",
  "frontend/src/components/MembershipRequestsTab.tsx": "Displays a filterable list of membership applications with cards showing applicant details, status badges, and approve/reject actions using the useUpdateMembershipStatus hook.",
  "frontend/src/components/MembershipSection.tsx": "Renders a public-facing membership registration form with validation, membership type selection, and submission via the useAddMembershipApplication hook.",
  "frontend/src/components/MembersListTab.tsx": "Admin tab that fetches and displays approved membership applications in a searchable card grid, with loading skeletons, error state, and badge styling per membership type.",
  "frontend/src/components/SearchBar.tsx": "A modal search overlay that filters predefined site sections by label or keywords and smoothly scrolls to the selected section on selection.",
  "frontend/src/components/VillagesPage.tsx": "Admin page for managing villages within a district, supporting add, inline edit, and delete operations with confirmation dialogs.",
  "frontend/src/components/VillagesSection.tsx": "Public-facing accordion view of districts and their associated villages, fetching village data lazily when a district card is expanded.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on ICP, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (queries and mutations) for CRUD operations on districts, villages, and other backend entities, with toast notifications on success/error.",
  "frontend/src/index.css": "Global stylesheet that imports Devanagari/Cinzel fonts, sets up a maroon/gold Islamic-themed CSS variable palette with Tailwind, and defines reusable component utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/clipboard.ts": "Clipboard utility that copies text using the modern Clipboard API with a fallback to execCommand for mobile browsers that lack clipboard access.",
  "frontend/src/utils/imageCompression.ts": "Client-side image compression utility that resizes images to a max of 800px and encodes them as JPEG at 65% quality using an HTML Canvas to stay under ICP's 2MB ingress limit.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routes, with sessionStorage persistence and helpers to clear sensitive params from the address bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with an Islamic maroon/gold/cream color palette using OKLCH values, Devanagari font families, and custom shadows and border radii.",
  "project_state.json": "Tracks project state for the Gausiya Ashrafia Foundation app, recording existing features, a known issue about a missing Admin Panel navigation button, and a pending fix request to add it."
}