{
  "backend/main.mo": "Main Motoko actor defining the backend canister with user profile management, district/village CRUD operations, and access control via prefab authorization and blob-storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting a single feature: updating GallerySection.tsx to display four new Admin Meet (September 21, 2025) event photos with Hindi title/subtitle in the existing maroon/gold card layout.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing each component's purpose, styling approach (maroon/gold palette), and key functionality for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark mode color tokens, applied to base body and border styles.",
  "frontend/index.html": "HTML entry point with Hindi language attribute, Google Fonts imports for Noto Serif/Sans Devanagari and Cinzel, and SEO meta description for the Gausiya Ashrafia Foundation site.",
  "frontend/src/App.tsx": "Root React component implementing hash-based routing that renders AdminPanel at `#/admin` and the full homepage section stack (Hero through Footer) for all other routes.",
  "frontend/src/components/AboutSection.tsx": "About section component rendering mission/vision cards, foundation history, and an 11-item core values grid with lucide-react icons using the maroon/gold OKLCH palette.",
  "frontend/src/components/ActivitiesSection.tsx": "Activities section that fetches and displays activity cards with images and dates via React Query, seeds initial data on mount, and shows four impact statistics (all currently set to '0').",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component with passcode authentication and Internet Identity login, providing tabbed views for donations, memberships, assistance requests, contacts, and district/village management including bulk CSV import.",
  "frontend/src/components/AssistanceSection.tsx": "Form section allowing users to submit assistance requests (name, mobile, city, type) with validation, mutation via useAddAssistanceRequest, and Hindi-language UI.",
  "frontend/src/components/ContactSection.tsx": "Contact section displaying foundation info (address, phone, email, social links) fetched from the backend and a contact inquiry form with validation that submits via useAddContactInquiry.",
  "frontend/src/components/DonationSection.tsx": "Donation section showing UPI QR code, bank details with copy buttons, preset amount buttons, and a donor registration form that submits via useAddDonation.",
  "frontend/src/components/Footer.tsx": "Site footer with foundation branding, quick navigation links, a Quranic quote, and a copyright bar with a heart icon.",
  "frontend/src/components/GallerySection.tsx": "Gallery section displaying a static grid of four photos from an admin panel meeting event held on 21 September 2025 in Mumbra, Maharashtra.",
  "frontend/src/components/GovernmentSchemesSection.tsx": "Renders a grid of cards showcasing six Indian government welfare schemes (e.g., PM Awas Yojana, Ayushman Bharat) with icons, Hindi descriptions, and eligibility info.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with the foundation logo, Hindi nav links, smooth-scroll handling, mobile hamburger menu, and a search icon that opens a SearchBar overlay.",
  "frontend/src/components/HeroSection.tsx": "Full-width hero banner with a background image, dark overlay, foundation name in Hindi/English, a tagline badge, and CTA buttons for donation and about sections.",
  "frontend/src/components/MembershipSection.tsx": "Membership registration form with text fields (name, mobile, email, city, Aadhaar) and file upload fields for address/identity proof, submitting via the useAddMembership hook.",
  "frontend/src/components/SearchBar.tsx": "Modal search overlay that filters predefined site sections by label or keywords and scrolls to the matching section anchor on selection.",
  "frontend/src/components/VillagesSection.tsx": "Accordion-style section listing districts fetched from the backend, each expandable to show associated village chips loaded via useGetVillagesByDistrict.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating app data (activities, donations, memberships, assistance requests, contact inquiries, foundation info) with all backend calls currently stubbed to return empty data.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, configures Tailwind layers, and defines a maroon/Islamic color palette with CSS custom properties, utility classes, and component styles.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/clipboard.ts": "Utility function that copies text to the clipboard using the modern Clipboard API with a fallback to execCommand for mobile browser compatibility.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback for sensitive values like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with oklch-based CSS variable colors, brand color palettes (maroon, tan, gold, cream), Devanagari/Cinzel font families, and custom border radius and shadow tokens.",
  "project_state.json": "Tracks the full project state for the गौसिया अशरफिया फाउंडेशन charitable society app, including architectural notes, known issues, color palette, image requirements, and a list of existing features with versioning."
}