{
  "backend/main.mo": "Main Motoko actor for the backend, defining stable state and CRUD endpoints for user profiles, districts, villages, gallery events, and gallery images, with authorization via AccessControl and blob storage mixins.",
  "backend/migration.mo": "Data migration module that upgrades the actor state from an older schema (no gallery fields) to a newer schema by adding nextEventId, nextImageId, galleryEvents, and galleryImages fields.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their IDs, titles, associated files, components, test IDs, and confidence levels for the AdminPanel, gallery hooks, and tabbed admin interface.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, describing their purpose, styling palette, and notable changes.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind layers and defines OKLCH-based CSS custom properties for light and dark theme color tokens (backgrounds, borders, charts, sidebar).",
  "frontend/index.html": "HTML shell for the React app with Hindi lang attribute, Google Fonts preconnect for Devanagari and Cinzel fonts, and a root div for the React mount point.",
  "frontend/src/App.tsx": "Root React component implementing hash-based routing that renders GallerySection at #/gallery, VillagesSection at #/villages, AdminPanel at #/admin, and the full homepage for all other routes.",
  "frontend/src/components/AboutSection.tsx": "About section component with an Intersection Observer scroll animation, mission/vision cards, foundation history block, and an 11-card core values grid styled with the maroon/gold palette.",
  "frontend/src/components/ActivitiesSection.tsx": "Displays a grid of six charity activity cards (education, food, health, etc.) with icons and descriptions, plus a stats bar showing impact numbers, with scroll-triggered animation.",
  "frontend/src/components/AdminPanel.tsx": "A passcode-protected admin panel for managing districts, villages, donations, memberships, assistance requests, contact inquiries, and gallery events/images, with a passcode change feature.",
  "frontend/src/components/AssistanceSection.tsx": "A form section allowing users to submit assistance requests (name, mobile, city, type) with validation, scroll animation, and mutation via useAddAssistanceRequest hook.",
  "frontend/src/components/ContactSection.tsx": "Displays contact information (address, phone, email, social links) alongside a contact inquiry form with validation that submits via useAddContactInquiry hook.",
  "frontend/src/components/DonationSection.tsx": "Donation section showing UPI QR code, bank details with copy buttons, preset and custom amount selection, and a donor name/transaction form submitted via useAddDonation hook.",
  "frontend/src/components/Footer.tsx": "Site footer with foundation branding, quick navigation links, a Quranic quote, and a copyright bar, styled with dark warm tones and a gradient top border.",
  "frontend/src/components/GallerySection.tsx": "Renders a gallery section that fetches and displays event photos in a responsive grid using the useGetGalleryEvents hook, with loading and empty states shown via Lucide icons.",
  "frontend/src/components/GovernmentSchemesSection.tsx": "Displays a static grid of six Indian government welfare schemes (e.g., PM Awas, Ayushman Bharat) with icons, descriptions, and eligibility info, with scroll-triggered animation.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with a logo, desktop nav links, mobile hamburger menu, and a search button that opens a SearchBar overlay; handles both hash-based routing and smooth scroll navigation.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a background image, gradient overlay, shimmer animation, and staggered fade-in text displaying the foundation name in Hindi/Arabic with call-to-action scroll buttons.",
  "frontend/src/components/MembershipSection.tsx": "Membership registration form with fields for name, mobile, email, city, and Aadhaar, plus optional file uploads for address and identity proof, submitted via the useAddMembership hook with client-side validation.",
  "frontend/src/components/SearchBar.tsx": "A modal search bar component that filters predefined Hindi/English site sections by keyword and scrolls to the matching section anchor on selection.",
  "frontend/src/components/VillagesSection.tsx": "Displays an accordion list of districts fetched from the backend, each expandable to show its associated village chips loaded on demand.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an ICP backend actor (anonymous or authenticated), initializing admin access control and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout functionality, identity persistence via AuthClient, and status tracking exposed through a React context and hook.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for CRUD operations on districts, villages, donations, gallery events/images, and memberships, each wired to the backend actor with toast notifications.",
  "frontend/src/index.css": "Global stylesheet that imports Devanagari/Cinzel fonts, defines a maroon/gold OKLCH CSS variable theme, and declares reusable Tailwind component classes for the Islamic-styled UI.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/clipboard.ts": "Utility function that copies text to the clipboard using the modern Clipboard API with a textarea/execCommand fallback for mobile and older browsers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH-based color palettes (maroon, tan, gold, cream), brand fonts including Devanagari and Cinzel, and custom border radius and shadow tokens.",
  "project_state.json": "Project state tracking file recording version 67 of the गौसिया अशरफिया फाउंडेशन charitable society app, including architectural notes, known issues (admin panel bugs, village tab errors), and a list of existing implemented features."
}