{
  "kind": "build_request",
  "title": "Fix Admin Panel Villages Tab — District Add Error",
  "projectName": "Gausiya Ashrafia Foundation",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-37",
      "text": "Investigate and fix the error occurring in the Admin Panel > Villages tab when attempting to add a district. The red error text visible on the UI indicates the `addDistrict` mutation is failing. Diagnose whether the issue is: (1) a backend authorization/permission check rejecting the call (admin-only guard), (2) a mismatch between the frontend mutation arguments and the backend `addDistrict(name: Text)` function signature, (3) an actor initialization issue causing the mutation to fail silently, or (4) an error in the `useAddDistrict` React Query mutation hook (wrong method name, incorrect argument shape, or missing actor reference). Fix the root cause so that submitting the Add District form in the Villages tab successfully calls the backend, adds the district, invalidates the districts query, and shows a success toast instead of a red error message.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "एडमिन पैनल में प्रॉब्लम है लाल रंग का टेक्स्ट दिखता है",
          "Admin Panel > Villages Tab में District Add करने पर लाल रंग का error text दिखता है — district add नहीं हो रहा"
        ]
      },
      "acceptanceCriteria": [
        "Entering a district name in the Admin Panel > Villages tab and clicking the submit button successfully calls the backend `addDistrict` endpoint without throwing an error.",
        "After a successful district add, the districts list in the Admin Panel refreshes and shows the newly added district.",
        "A success toast notification is shown after successfully adding a district.",
        "No red error text is displayed on the Admin Panel Villages tab during or after a district add operation.",
        "If the backend returns a genuine error (e.g., duplicate name), it is displayed as a meaningful error message rather than a raw JS error.",
        "The Add Village form similarly works without errors when a valid district is selected and a village name is entered."
      ]
    }
  ],
  "constraints": [
    "Do not change the backend district/village data model or API signatures.",
    "Do not modify files listed under frontend.immutablePaths.",
    "Admin passcode gate and tab structure of AdminPanel.tsx must remain intact."
  ],
  "nonGoals": [
    "Adding new admin panel tabs or features.",
    "Changing the visual theme or color palette.",
    "Modifying any section other than the Villages tab error handling."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}