{
  "kind": "build_request",
  "title": "New Admin Panel with Gallery Management, Village Controls, Passcode Change, and Site Animations",
  "projectName": "Gausiya Ashrafia Foundation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-70",
      "text": "Create a new Admin Panel component at frontend/src/components/AdminPanel.tsx with a passcode login gate using the default passcode 'damin1234' (stored in localStorage under key 'gaf_admin_passcode', falling back to 'damin1234' if no stored value). The login gate must trim whitespace and use strict string equality. Style the login gate with a centered card layout using the cream/maroon palette (bg-[#fdf6e3] page, bg-white card, maroon border, maroon button).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "एडमिन पैनल के लिए डिफॉल्ट पासकोड damin1234 रखे",
          "हा, एडमिन पैनल में गैलेरी मैनेजमेंट का टैब हो"
        ]
      },
      "acceptanceCriteria": [
        "Entering 'damin1234' and clicking the login button successfully unlocks the Admin Panel",
        "Entering a wrong passcode shows an error message",
        "The login gate is styled with cream/maroon palette (bg-[#fdf6e3] background, white card, maroon accents)",
        "The passcode check trims whitespace before comparison"
      ]
    },
    {
      "id": "REQ-71",
      "text": "Add a backend Motoko data model and API for managing gallery events. Each GalleryEvent record should have: id (auto-incremented Nat), title (Text), subtitle (Text), createdAt (Int timestamp), and a list of associated GalleryImage records. Each GalleryImage record should have: id (Nat), eventId (Nat), imageData (Text — base64 data URI), caption (Text), sortOrder (Nat). Expose: addGalleryEvent(title: Text, subtitle: Text): async Nat, getGalleryEvents(): async [GalleryEvent], deleteGalleryEvent(eventId: Nat): async Bool, addGalleryImage(eventId: Nat, imageData: Text, caption: Text): async Nat, getGalleryImagesByEvent(eventId: Nat): async [GalleryImage], deleteGalleryImage(imageId: Nat): async Bool. Store all data in stable variables.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "गैलरी अपडेट एडमिन पैनल से किया जा सके"
        ]
      },
      "acceptanceCriteria": [
        "addGalleryEvent creates a new gallery event and returns its ID",
        "getGalleryEvents returns all gallery events",
        "deleteGalleryEvent removes an event and returns Bool",
        "addGalleryImage stores base64 image data associated with an event and returns image ID",
        "getGalleryImagesByEvent returns all images for a given event",
        "deleteGalleryImage removes an image and returns Bool",
        "All data persists across canister upgrades via stable variables"
      ]
    },
    {
      "id": "REQ-72",
      "text": "Add React Query hooks to frontend/src/hooks/useQueries.ts for the new gallery backend endpoints: useGetGalleryEvents(), useAddGalleryEvent() (mutation returning new event id), useDeleteGalleryEvent() (mutation), useGetGalleryImagesByEvent(eventId: number | null) (disabled when eventId is null), useAddGalleryImage() (mutation accepting eventId, imageData, caption), useDeleteGalleryImage() (mutation). Follow the existing hook patterns in the file. All mutations must call backend actor methods without requiring authenticated Internet Identity (use anonymous actor).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "गैलरी अपडेट एडमिन पैनल से किया जा सके"
        ]
      },
      "acceptanceCriteria": [
        "useGetGalleryEvents fetches all gallery events",
        "useAddGalleryEvent mutation creates a new event",
        "useDeleteGalleryEvent mutation removes an event",
        "useGetGalleryImagesByEvent is disabled when eventId is null",
        "useAddGalleryImage mutation uploads image data to the backend",
        "useDeleteGalleryImage mutation removes an image",
        "All hooks follow existing patterns in useQueries.ts"
      ]
    },
    {
      "id": "REQ-73",
      "text": "In the new AdminPanel component (frontend/src/components/AdminPanel.tsx), implement a tabbed interface with six tabs: (1) Donations — table of all donation records using useGetDonations; (2) Memberships — table of all membership registrations using useGetMemberships, with address/identity proof download links; (3) Assistance Requests — table using useGetAssistanceRequests; (4) Contact Inquiries — table using useGetContactInquiries; (5) Villages — district/village management with manual add forms (useAddDistrict, useAddVillage), bulk import (text-paste and Excel/CSV file upload via SheetJS), export to Excel and PDF (via jsPDF), and a districts list with delete buttons (useDeleteDistrict, useDeleteVillage); (6) Gallery Management — interface to create gallery events (title + subtitle form), upload images (file input converted to base64, with caption field) per event, and delete events/images. Style the entire panel with the maroon/gold palette: bg-[#fdf6e3] page root, bg-white tab content areas, maroon (#632626) tab bar with gold (#dacc96) active tab text, text-gray-900 body text, maroon section headings, gold borders, cream form inputs with maroon focus border, maroon header row in tables with alternating row colors. Remove all Internet Identity / isAdmin login checks — passcode gate is the only authentication layer.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "एडमिन पैनल में गैलेरी मैनेजमेंट का टैब हो",
          "गाँव जोड़ने और हटाने का भी ऑप्शन रहे",
          "एडमिन पैनल पासवर्ड बदनले का भी ऑप्शन रहे"
        ]
      },
      "acceptanceCriteria": [
        "All six tabs render correctly with light cream/white backgrounds and readable dark text",
        "Donations, Memberships, Assistance Requests, and Contact Inquiries tabs display data in styled tables",
        "Villages tab: Add District form submits without authorization errors and shows success toast",
        "Villages tab: Add Village form submits without authorization errors and shows success toast",
        "Villages tab: Bulk text-paste import parses 'District: Village1, Village2' format correctly and shows count in button label",
        "Villages tab: Bulk Excel/CSV file upload (SheetJS) processes Column A = District, Column B = Village with sequential async processing",
        "Villages tab: Export to Excel produces villages-export.xlsx",
        "Villages tab: Export to PDF produces villages-export.pdf",
        "Gallery Management tab: Admin can create a new gallery event with title and subtitle",
        "Gallery Management tab: Admin can upload images (converted to base64) with captions to an event",
        "Gallery Management tab: Admin can delete events and individual images",
        "No Internet Identity login requirement gates any form submission — only the passcode gate is required",
        "The Admin Panel header shows the correct foundation name 'गौसिया अशरफिया फाउंडेशन'"
      ]
    },
    {
      "id": "REQ-74",
      "text": "Add a 'Change Passcode' (पासकोड बदलें) section within the Admin Panel (frontend/src/components/AdminPanel.tsx), displayed in the panel header or as a settings tab after login. The form has three fields: Current Passcode, New Passcode (minimum 6 characters), and Confirm New Passcode. Validate that the current passcode matches the stored value, that new passcode and confirmation match, and that new passcode meets minimum length. On success, update localStorage key 'gaf_admin_passcode' and show a success toast. Show clear inline error messages on validation failure.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "एडमिन पैनल पासवर्ड बदनले का भी ऑप्शन रहे"
        ]
      },
      "acceptanceCriteria": [
        "Change Passcode form is visible after successful login",
        "Submitting with correct current passcode, matching new passcode (≥6 chars) updates localStorage and shows success toast",
        "Entering wrong current passcode shows error message",
        "Mismatched new passcode and confirmation shows error message",
        "New passcode shorter than 6 characters shows error message",
        "After changing passcode, logging out and logging back in with the new passcode succeeds"
      ]
    },
    {
      "id": "REQ-75",
      "text": "Add the Admin Panel route back to frontend/src/App.tsx as a hash route (#/admin) that renders the new AdminPanel component (with the site Header and Footer) when that hash is active. The homepage layout and other routes (#/gallery, #/villages) must remain intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "नया एडमिन पैनल बनाये जिसमे सारे कंट्रोल रहे"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /#/admin renders the AdminPanel component",
        "Homepage layout is unaffected",
        "/#/gallery and /#/villages routes still work"
      ]
    },
    {
      "id": "REQ-76",
      "text": "Add an 'Admin' navigation link back to the Header component (frontend/src/components/Header.tsx) in the hamburger/mobile menu only (NOT in the desktop navigation bar). Clicking the Admin link should navigate to /#/admin and close the hamburger menu.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "नया एडमिन पैनल बनाये जिसमे सारे कंट्रोल रहे"
        ]
      },
      "acceptanceCriteria": [
        "Admin link appears in the hamburger/mobile menu",
        "Admin link is NOT present in the desktop navigation bar",
        "Clicking the Admin link navigates to /#/admin",
        "The hamburger menu closes after clicking the Admin link"
      ]
    },
    {
      "id": "REQ-77",
      "text": "Update the GallerySection component (frontend/src/components/GallerySection.tsx) to dynamically fetch and display gallery events and their images from the backend using the useGetGalleryEvents and useGetGalleryImagesByEvent hooks. Display each event as a card with a responsive image grid, event title, and subtitle caption. Show a loading state while fetching. If no events exist, show an empty-state message (e.g., 'अभी तक कोई फोटो नहीं जोड़ी गई'). Retain the 'गैलेरी' section heading and decorative gold divider. Style consistently with the existing maroon/gold palette.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "गैलरी अपडेट एडमिन पैनल से किया जा सके"
        ]
      },
      "acceptanceCriteria": [
        "GallerySection fetches events from the backend via useGetGalleryEvents",
        "Each event card shows a responsive image grid with all associated images",
        "Event title and subtitle are displayed as caption below the grid",
        "Empty state message is shown when no events exist",
        "Loading state is shown while fetching",
        "Section heading 'गैलेरी' and gold divider are retained"
      ]
    },
    {
      "id": "REQ-78",
      "text": "Add scroll-triggered fade-in and slide-in entrance animations to all major page sections (HeroSection, AboutSection, DonationSection, ActivitiesSection, GovernmentSchemesSection, MembershipSection, AssistanceSection, ContactSection, Footer). Use the Intersection Observer API (or a lightweight CSS approach with Tailwind animation utilities) to trigger animations when each section enters the viewport. Each section should animate once — fading in and sliding up from slightly below its final position. Ensure animations do not cause layout shift or affect performance negatively.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "स्क्रोल करने पर सेक्शन फेड इन/स्लाइड इन एनिमशन चाहिए"
        ]
      },
      "acceptanceCriteria": [
        "Each major section fades in and slides up when it enters the viewport while scrolling",
        "Animations trigger only once per page load (not repeatedly)",
        "No layout shift occurs during or after animation",
        "Animations work on both desktop and mobile"
      ]
    },
    {
      "id": "REQ-79",
      "text": "Add hover and focus animations to all interactive buttons and card elements throughout the app. Buttons should have a smooth scale-up (e.g., scale-105) and subtle shadow increase on hover, plus a color transition. CTA buttons in HeroSection should have an additional glow/pulse effect. Navigation links should have an underline slide-in animation on hover. Cards in AboutSection, ActivitiesSection, GovernmentSchemesSection, and MembershipSection should lift slightly (translate-y and shadow increase) on hover.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "बटन पर होवर इफ़ेक्ट चाहिए"
        ]
      },
      "acceptanceCriteria": [
        "All buttons show scale-up and shadow effects on hover with smooth CSS transitions",
        "HeroSection CTA buttons have a glow or pulse animation",
        "Navigation links have hover underline animation",
        "Cards in major sections lift and show increased shadow on hover",
        "Animations use CSS transitions (not JS-heavy libraries) for performance"
      ]
    },
    {
      "id": "REQ-80",
      "text": "Add a special entrance animation to the HeroSection component. The foundation name in Hindi/English should animate in with a staggered fade-in-up sequence (each text element appearing one after another). The tagline badge should appear with a scale-in animation. The CTA buttons should slide in from below. Include a subtle background shimmer or parallax scroll effect on the hero background image overlay. All animations should complete within 2 seconds of page load.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "हीरो सेक्शन में भी खास एनिमेशन चाहिए"
        ]
      },
      "acceptanceCriteria": [
        "Foundation name text elements animate in with staggered fade-in-up on page load",
        "Tagline badge animates in with a scale-in effect",
        "CTA buttons slide in from below after the text animations",
        "A subtle background shimmer or overlay animation is present on the hero image",
        "All animations complete within 2 seconds of page load",
        "Animations are smooth and do not cause jank on mobile devices"
      ]
    },
    {
      "id": "REQ-81",
      "text": "In backend/main.mo, ensure the addGalleryEvent, getGalleryEvents, deleteGalleryEvent, addGalleryImage, getGalleryImagesByEvent, and deleteGalleryImage functions have no caller-identity or admin-only guards — they must accept calls from any caller (anonymous or authenticated). This is consistent with the existing pattern applied to addDistrict, addVillage, deleteDistrict, and deleteVillage.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "गैलरी अपडेट एडमिन पैनल से किया जा सके"
        ]
      },
      "acceptanceCriteria": [
        "addGalleryEvent can be called by anonymous callers without authorization error",
        "deleteGalleryEvent can be called by anonymous callers without authorization error",
        "addGalleryImage can be called by anonymous callers without authorization error",
        "deleteGalleryImage can be called by anonymous callers without authorization error",
        "No IC0508 or Unauthorized errors when gallery mutations are called from the Admin Panel"
      ]
    }
  ],
  "constraints": [
    "Default passcode for the new Admin Panel must be exactly 'damin1234' (not 'admin1234')",
    "All backend authorization guards on district/village/gallery CRUD functions must remain removed (no caller identity checks)",
    "Do not edit files listed in frontend.immutablePaths",
    "All backend logic must remain in the single main actor file (backend/main.mo)",
    "Gallery image data must be stored as base64 text in the backend — do not use separate blob canister",
    "Bulk import must use sequential async processing (not parallel) to avoid race conditions",
    "Animations must use CSS transitions/Intersection Observer and must not introduce heavy animation libraries"
  ],
  "nonGoals": [
    "Do not add Internet Identity / Web3 wallet authentication to the new Admin Panel",
    "Do not create a separate backend canister for gallery storage",
    "Do not add real-time features (WebSockets, live updates) to the gallery",
    "Do not change the existing color palette or typography",
    "Do not modify the VillagesSection or GovernmentSchemesSection logic beyond adding animations"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}