{
  "kind": "build_request",
  "title": "Fix VillagesSection not appearing in production (live) build",
  "projectName": "Gausiya Ashrafia Foundation",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-49",
      "text": "Investigate and fix the VillagesSection component not rendering in the production/live build while it correctly appears in the draft build. The screenshots confirm: (1) in the live tab, the 'हमसे जुड़े गाँव' section renders but shows 'अभी तक कोई जिला नहीं जोड़ा गया' — meaning the section renders but district data added in draft is not persisting/syncing to production; OR (2) the section itself is missing from the production bundle. Check whether the issue is: (a) the VillagesSection component is included in App.tsx but the production canister has stale/empty stable state (districts added via the draft environment are not present in the production canister), (b) a build/bundle difference between draft and production that causes the section to be omitted, or (c) a backend stable variable migration issue where the production canister's district/village data was reset on upgrade. Ensure that: the VillagesSection is present and rendered in App.tsx for the production route, the backend stable variables for districts and villages are correctly preserved across canister upgrades using stable var declarations, and the production canister's data is not silently reset. After the fix, the 'हमसे जुड़े गाँव' section must appear on the live site with the same district/village data visible in the draft.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "हमसे जुड़े गांव ड्राफ्ट में तो दिख रहा है लेकिन लाइव में नही दिख रहा है"
        ]
      },
      "acceptanceCriteria": [
        "The 'हमसे जुड़े गाँव' (VillagesSection) is visible on the live/production site at the correct position between GovernmentSchemesSection and MembershipSection.",
        "Districts and villages added via the Admin Panel in draft are available (or re-enterable) in production without data loss on canister upgrade.",
        "Backend stable variables for districts and villages use `stable var` declarations so data survives canister upgrades.",
        "The section heading, accordion district cards, and village chips all render correctly in the production build.",
        "No regression in draft — the section continues to display correctly there as well."
      ]
    }
  ],
  "constraints": [
    "Do not change the VillagesSection UI design or behavior — only fix the production availability issue.",
    "Backend stable variable declarations must not cause a breaking migration that wipes existing data."
  ],
  "nonGoals": [
    "Adding new districts or villages as seed data.",
    "Changing the VillagesSection visual design or accordion interaction.",
    "Modifying any other section or component unrelated to this bug."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}