{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Admin Panel Villages Tab — District Add Error",
  "requirements": [
    {
      "id": "REQ-37",
      "summary": "Fix the addDistrict mutation error in the Admin Panel Villages tab by correcting the mutation hook to properly call the backend addDistrict method with the correct argument shape, add proper error handling, and ensure the districts query invalidates after successful addition",
      "acceptanceCriteria": [
        "Entering a district name in the Admin Panel > Villages tab and clicking the submit button successfully calls the backend `addDistrict` endpoint without throwing an error.",
        "After a successful district add, the districts list in the Admin Panel refreshes and shows the newly added district.",
        "A success toast notification is shown after successfully adding a district.",
        "No red error text is displayed on the Admin Panel Villages tab during or after a district add operation.",
        "If the backend returns a genuine error (e.g., duplicate name), it is displayed as a meaningful error message rather than a raw JS error.",
        "The Add Village form similarly works without errors when a valid district is selected and a village name is entered."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix the useAddDistrict mutation hook to correctly call actor.addDistrict(name) with a single string argument (not an object). Update the mutationFn to pass the district name directly as a string parameter. Ensure the onSuccess callback properly invalidates the 'districts' query key to trigger a refetch. Add proper error handling in onError to display meaningful error messages via toast notifications instead of allowing raw errors to propagate to the UI."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix the useAddVillage mutation hook to correctly call actor.addVillage(districtId, villageName) with two separate arguments (bigint and string). Update the mutationFn to destructure the variables object and pass districtId and villageName as individual parameters. Ensure the onSuccess callback invalidates both 'districts' and the specific district's villages query. Add proper error handling in onError with toast notifications for user-friendly error display."
        },
        {
          "path": "frontend/src/components/AdminPanel.tsx",
          "operation": "modify",
          "description": "Update the Villages tab district form submission handler to pass the district name as a plain string (not wrapped in an object) to the addDistrict mutation. Remove any object wrapping like {name: districtName} and pass districtName directly. Ensure the form clears the input field after successful submission. Add visual feedback (loading state on submit button) during the mutation. Verify that error states from the mutation hook are properly displayed to the user without showing raw error objects."
        },
        {
          "path": "frontend/src/components/AdminPanel.tsx",
          "operation": "modify",
          "description": "Update the Villages tab village form submission handler to pass districtId and villageName as an object {districtId, villageName} to the addVillage mutation, ensuring districtId is converted to bigint if needed. Ensure the form clears after successful submission and displays proper loading states. Add error boundary handling to catch and display authorization errors (admin-only guards) in a user-friendly format rather than showing red error text."
        }
      ]
    }
  ]
}