{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Canister Stopped Error Blocking District/Village Add Operations",
  "requirements": [
    {
      "id": "REQ-58",
      "summary": "Perform end-to-end verification of Admin Panel Villages tab after canister fix, ensuring all district/village add operations (individual forms, Excel/CSV bulk import, text-paste bulk import) work without IC0508, authorization, or mutation errors",
      "acceptanceCriteria": [
        "Adding a district individually via the form succeeds and the district appears in the list.",
        "Adding a village individually via the form succeeds and the village appears under the correct district.",
        "Uploading an Excel/CSV file with district-village rows processes all entries and shows a summary toast.",
        "Text-paste bulk import correctly parses and imports district/village data.",
        "No red error messages appear in the Villages tab after any of these operations.",
        "Success toasts are shown for all successful add operations."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminPanel.tsx",
          "operation": "modify",
          "description": "Review and enhance the Villages tab UI to ensure all four district/village add operations (individual district form, individual village form, Excel/CSV bulk import, text-paste bulk import) properly invoke the backend addDistrict and addVillage methods from the actor. Ensure all mutation hooks from useQueries.ts are correctly wired with proper error handling that catches IC0508 canister stopped errors and displays user-friendly error toasts. Add success toast notifications for all successful add operations. Verify that the district dropdown in the 'नया गाँव जोड़ें' form is populated with fresh district data after a district is added. Ensure the Excel/CSV file upload processes all rows sequentially, shows a progress indicator during bulk import, and displays a summary toast with the count of successfully imported districts and villages. Verify that the text-paste bulk import (टेक्स्ट से आयात) correctly parses 'District: Village1, Village2' format and calls addDistrict/addVillage for each entry. After any successful add operation, invalidate the 'districts' query key to refresh the displayed list. Do not modify the passcode authentication gate or add new authorization checks."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and update the mutation hooks for addDistrict, addVillage, deleteDistrict, and deleteVillage to ensure they correctly call the backend actor methods defined in backend.d.ts (addDistrict(name: string): Promise<bigint>, addVillage(districtId: bigint, villageName: string): Promise<bigint>, deleteDistrict(districtId: bigint): Promise<boolean>, deleteVillage(villageId: bigint): Promise<boolean>). Replace any stubbed/mock implementations with actual actor calls. Ensure all mutation hooks include onSuccess callbacks that invalidate the 'districts' query to trigger a refetch and update the UI. Add proper error handling that catches replica rejection errors (including IC0508 canister stopped errors) and surfaces them to the UI via the mutation's onError callback or error state. Verify that bulk import operations (Excel/CSV and text-paste) use these mutation hooks in a loop or batch, tracking progress and aggregating results for the summary toast. Do not add any authorization or principal checks in these hooks; all backend functions must accept calls from any caller."
        },
        {
          "path": "frontend/src/components/VillagesSection.tsx",
          "operation": "modify",
          "description": "Review the public-facing villages accordion component to ensure it correctly fetches and displays districts and villages using the useGetDistricts and useGetVillagesByDistrict query hooks from useQueries.ts. Verify that the component handles loading states with skeletons and error states with user-friendly messages. Ensure the accordion expands to load villages for a district using the backend getVillagesByDistrict method. This component is read-only and should not include any add/edit/delete UI. Do not modify any authentication or authorization logic."
        }
      ]
    }
  ]
}