{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix VillagesSection data persistence in production build",
  "requirements": [
    {
      "id": "REQ-49",
      "summary": "Ensure VillagesSection component renders with district and village data in the production build by verifying component wiring in App.tsx and ensuring the frontend correctly fetches and displays backend district data",
      "acceptanceCriteria": [
        "The 'हमसे जुड़े गाँव' (VillagesSection) is visible on the live/production site at the correct position between GovernmentSchemesSection and MembershipSection.",
        "Districts and villages added via the Admin Panel in draft are available (or re-enterable) in production without data loss on canister upgrade.",
        "Backend stable variables for districts and villages use `stable var` declarations so data survives canister upgrades.",
        "The section heading, accordion district cards, and village chips all render correctly in the production build.",
        "No regression in draft — the section continues to display correctly there as well."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify that VillagesSection is imported and rendered in the correct position in the homepage section stack (between GovernmentSchemesSection and MembershipSection). Ensure there are no conditional rendering statements that would prevent VillagesSection from appearing in production. Confirm the component is rendered on the default route (non-admin routes)."
        },
        {
          "path": "frontend/src/components/VillagesSection.tsx",
          "operation": "modify",
          "description": "Review the component to ensure it correctly handles empty state when no districts are available. Verify that the component uses the useGetDistricts hook correctly and that the empty state message 'अभी तक कोई जिला नहीं जोड़ा गया' is only shown when the backend returns an empty array (not when loading or on error). Add error handling for backend failures and ensure loading states are properly managed. Confirm that district expansion correctly triggers useGetVillagesByDistrict for lazy-loading villages."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure useGetDistricts correctly calls actor.getDistricts() and returns the full array of District objects with proper TypeScript typing. Verify that useGetVillagesByDistrict correctly fetches villages for a given districtId using actor.getVillagesByDistrict(districtId). Ensure both hooks have proper error handling, retry logic, and React Query configuration (queryKey, enabled flags). Confirm that these hooks are not no-ops and actually invoke the backend methods defined in backend.d.ts."
        },
        {
          "path": "frontend/src/components/AdminPanel.tsx",
          "operation": "modify",
          "description": "Review the districts/villages management tab to ensure that addDistrict and addVillage mutations correctly call the backend methods and invalidate the relevant React Query cache keys (['districts'], ['villages', districtId]). Verify that after adding a district or village in the admin panel, the changes are immediately reflected in the VillagesSection on the public site. Ensure that deleteDistrict and deleteVillage also invalidate the correct query keys."
        }
      ]
    }
  ]
}